package main

// Чёрные и белые листы ...
var (
	BlackList map[string]subnet
	WhiteList map[string]subnet
)

// masks Слайс возможных масок подсети...

var masks = [33][4]byte{
	{0, 0, 0, 0}, {128, 0, 0, 0}, {192, 0, 0, 0}, {224, 0, 0, 0}, {240, 0, 0, 0}, {248, 0, 0, 0}, {252, 0, 0, 0}, {254, 0, 0, 0}, {255, 0, 0, 0},
	{255, 128, 0, 0}, {255, 192, 0, 0}, {255, 224, 0, 0}, {255, 240, 0, 0}, {255, 248, 0, 0}, {255, 252, 0, 0}, {255, 254, 0, 0}, {255, 255, 0, 0},
	{255, 255, 128, 0}, {255, 255, 192, 0}, {255, 255, 224, 0}, {255, 255, 240, 0}, {255, 255, 248, 0}, {255, 255, 252, 0}, {255, 255, 254, 0},
	{255, 255, 255, 0}, {255, 255, 255, 128}, {255, 255, 255, 192}, {255, 255, 255, 224}, {255, 255, 255, 240}, {255, 255, 255, 248},
	{255, 255, 255, 252}, {255, 255, 255, 254}, {255, 255, 255, 255},
}

// Config Максимальное количество попыток аутентификации под указанным параметром в минуту (значения по умолчанию) ...

type Config struct {
	N       int    `yaml:"N"`
	M       int    `yaml:"M"`
	K       int    `yaml:"K"`
	Port    string `yaml:"Port"`
	LogPath string `yaml:"LogPath"`
}

var Cfg Config

// MaxBucketsInCache Максимальное количество элементов КЭШ для ...

var MaxBucketsInCache int = 1000

// LoginLru Кэш для хранения контейнера логинов ...
var LoginLru Cache

// PasswLru Кэш для хранения контейнера парлей ...
var PasswLru Cache

// IPLru Кэш для хранения контейнера IP адресов ...
var IPLru Cache

// inChan Канал для передачи данных ...
var inChan chan Auth

// outChan Канал для  возврата результата  ...
var outChan chan bool

// stopChan Канал для передачи останова ...
var stopChan chan bool

// Auth структура для пероедачи параметров аутенфикации
type Auth struct {
	l string
	p string
	i string
}
